### 1.7. 데이터 보간

**보간**은 쉽게 말해 빈 데이터를 특정 규칙으로 메꾸는 작업입니다.

- isna(): 결측치 확인. True, False 값 반환
- 결측치 대체:
    - fillna(): 괄호 안의 값으로 NaN값 대체해줘
    - replace(a, b): a를 b로 바꿔줘
- reset_index(): 인덱스 초기화

In [ ]:
titanic_df.isna().head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10
0,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [ ]:
# 컬럼별 결손 데이터 개수 구하기 
# True 값의 개수를 센 값이 되는거죠!
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Age_0            0
Age_by_10      177
dtype: int64

**주의**

 fillna()를 이용해 반환 값을 다시 받거나, inplace=True 파라미터를 fillna()에 추가해야 실제 데이터 세트 값이 변경됩니다.
|예시|결과|
|----------|-----|
|titanic_df['Cabin'].fillna('C000')|원본 데이터에 반영 X|
|titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')|원본 데이터에 반영 O|
|titanic_df['Cabin'].fillna('C000', inplace = True)|원본 데이터에 반영 O|

In [ ]:
# 원본 데이터에 반영되지 않음
titanic_df['Cabin'].fillna('C000')

0      C000
1       C85
2      C000
3      C123
4      C000
       ...
886    C000
887     B42
888    C000
889    C148
890    C000
Name: Cabin, Length: 891, dtype: object

In [ ]:
titanic_df['Cabin']

0       NaN
1       C85
2       NaN
3      C123
4       NaN
       ...
886     NaN
887     B42
888     NaN
889    C148
890     NaN
Name: Cabin, Length: 891, dtype: object

In [ ]:
# 원본데이터에 반영 O
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C000,S,0,320.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C000,S,0,360.0

In [ ]:
# 원본데이터에 반영 O
titanic_df['Cabin'].fillna('C000', inplace=True)

In [ ]:
titanic_df['Cabin']

0      C000
1       C85
2      C000
3      C123
4      C000
       ...
886    C000
887     B42
888    C000
889    C148
890    C000
Name: Cabin, Length: 891, dtype: object